{
    "comments":[
        {
            "text" : "As I was doing it, i noticed it was more interesting and it has potentials",
            "participant" : 1  
        },
        {
            "text": "I would be happy to try it if you want me to test it once you finish building it",
            "participant": 2
        },
        {
            "text" : "I believe consistency will be very important, same gestures for same things, like selection. Nothing too complicated, like going crazy with my hands, it is very cool",
            "participant" : 3
        },
        {
            "text" : "It is really intresting, I hope you develop this technology so quickly so I can use it",
            "participant" : 5
        },
        {
            "text" : "Suggested to use haptic keyboard on the back of the hand to faster typing, thus, we no longer need to use the keyboard at all, combined with the gestures",
            "participant" : 6
        },
        {
            "text" : "He mentioned moving the mouse with your eyes, it could be better to move the cursor with our eyes",
            "participant" : 8
        },
        {
            "text" : "It is very interesting because I like IT stuff, when I learned about CAT tools I was excited to learn about it, because it did not about CAT tools before, making it easy to do my job. Maybe gestures will make it more interesting and add physical movement to your hands, because you are sitting all day long and don't have much physical movement. Using the mouse causing tiring to my hand",
            "participant" : 8
        },
        {
            "text" : "She suggested that to typing the air would make it faster than using the physical keyboard, and only using one hand to typingsead of two hands",
            "participant" : 9
        },
        {
            "text" : "It is interesting, i would like to try it",
            "participant" : 11
        },
        {
            "text" : "The participant also suggested to use the keyboard in combination with the eyes movement, he suggested to press and hold s then move the eyes to select and then release to indicate the end of the selection",
            "participant" : 12
        },
        {
            "text" : "He suggested that to select one word you can use just the whole hand to grab it, then do whatever you want. To select specific part of word or multiple words, then use the index and thumb, similar to chopsticks. It think it is important to consider the logic of other languages, e.g. with Japanese where there is no spaces between words",
            "participant" : 12
        },
        {
            "text" : "I think it could be useful, probably not to all people, but many could be interested, because it could save them time and more convienent",
            "participant" : 13
        },
        {
            "text" : "I gave mostly 5 for easiness because i think there could be better gestures. This could be good to save time, there are about 20 translation projects every one hour, with this approach i think translators could save time. I imagine there will be some other better options",
            "participant" : 14
        }
    ]
}